virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27_DFP/component/udphs.h
#define UDPHS_IEN_EPT__Pos                    _U_(8)                                               /**< (UDPHS_IEN Position) Endpoint x Interrupt Enable (cleared upon USB reset) */
#define UDPHS_IEN_EPT__Msk                    (_U_(0xFFFF) << UDPHS_IEN_EPT__Pos)                  /**< (UDPHS_IEN Mask) EPT_ */
#define UDPHS_IEN_EPT_(value)                 (UDPHS_IEN_EPT__Msk & ((value) << UDPHS_IEN_EPT__Pos)) 
#define UDPHS_IEN_DMA__Pos                    _U_(25)                                              /**< (UDPHS_IEN Position) DMA Channel 7 Interrupt Enable (cleared upon USB reset) */
#define UDPHS_IEN_DMA__Msk                    (_U_(0x7F) << UDPHS_IEN_DMA__Pos)                    /**< (UDPHS_IEN Mask) DMA_ */
#define UDPHS_IEN_DMA_(value)                 (UDPHS_IEN_DMA__Msk & ((value) << UDPHS_IEN_DMA__Pos)) 

/* -------- UDPHS_INTSTA : (UDPHS Offset: 0x14) ( R/ 32) UDPHS Interrupt Status Register -------- */
#define UDPHS_INTSTA_SPEED_Pos                _U_(0)                                               /**< (UDPHS_INTSTA) Speed Status Position */
#define UDPHS_INTSTA_SPEED_Msk                (_U_(0x1) << UDPHS_INTSTA_SPEED_Pos)                 /**< (UDPHS_INTSTA) Speed Status Mask */
#define UDPHS_INTSTA_SPEED(value)             (UDPHS_INTSTA_SPEED_Msk & ((value) << UDPHS_INTSTA_SPEED_Pos))
#define UDPHS_INTSTA_DET_SUSPD_Pos            _U_(1)                                               /**< (UDPHS_INTSTA) Suspend Interrupt Position */
#define UDPHS_INTSTA_DET_SUSPD_Msk            (_U_(0x1) << UDPHS_INTSTA_DET_SUSPD_Pos)             /**< (UDPHS_INTSTA) Suspend Interrupt Mask */
#define UDPHS_INTSTA_DET_SUSPD(value)         (UDPHS_INTSTA_DET_SUSPD_Msk & ((value) << UDPHS_INTSTA_DET_SUSPD_Pos))
#define UDPHS_INTSTA_MICRO_SOF_Pos            _U_(2)                                               /**< (UDPHS_INTSTA) Micro Start Of Frame Interrupt Position */
#define UDPHS_INTSTA_MICRO_SOF_Msk            (_U_(0x1) << UDPHS_INTSTA_MICRO_SOF_Pos)             /**< (UDPHS_INTSTA) Micro Start Of Frame Interrupt Mask */
#define UDPHS_INTSTA_MICRO_SOF(value)         (UDPHS_INTSTA_MICRO_SOF_Msk & ((value) << UDPHS_INTSTA_MICRO_SOF_Pos))
#define UDPHS_INTSTA_INT_SOF_Pos              _U_(3)                                               /**< (UDPHS_INTSTA) Start Of Frame Interrupt Position */
#define UDPHS_INTSTA_INT_SOF_Msk              (_U_(0x1) << UDPHS_INTSTA_INT_SOF_Pos)               /**< (UDPHS_INTSTA) Start Of Frame Interrupt Mask */
#define UDPHS_INTSTA_INT_SOF(value)           (UDPHS_INTSTA_INT_SOF_Msk & ((value) << UDPHS_INTSTA_INT_SOF_Pos))
#define UDPHS_INTSTA_ENDRESET_Pos             _U_(4)                                               /**< (UDPHS_INTSTA) End Of Reset Interrupt Position */
#define UDPHS_INTSTA_ENDRESET_Msk             (_U_(0x1) << UDPHS_INTSTA_ENDRESET_Pos)              /**< (UDPHS_INTSTA) End Of Reset Interrupt Mask */
#define UDPHS_INTSTA_ENDRESET(value)          (UDPHS_INTSTA_ENDRESET_Msk & ((value) << UDPHS_INTSTA_ENDRESET_Pos))
#define UDPHS_INTSTA_WAKE_UP_Pos              _U_(5)                                               /**< (UDPHS_INTSTA) Wake Up CPU Interrupt Position */
#define UDPHS_INTSTA_WAKE_UP_Msk              (_U_(0x1) << UDPHS_INTSTA_WAKE_UP_Pos)               /**< (UDPHS_INTSTA) Wake Up CPU Interrupt Mask */
#define UDPHS_INTSTA_WAKE_UP(value)           (UDPHS_INTSTA_WAKE_UP_Msk & ((value) << UDPHS_INTSTA_WAKE_UP_Pos))
#define UDPHS_INTSTA_ENDOFRSM_Pos             _U_(6)                                               /**< (UDPHS_INTSTA) End Of Resume Interrupt Position */
#define UDPHS_INTSTA_ENDOFRSM_Msk             (_U_(0x1) << UDPHS_INTSTA_ENDOFRSM_Pos)              /**< (UDPHS_INTSTA) End Of Resume Interrupt Mask */
#define UDPHS_INTSTA_ENDOFRSM(value)          (UDPHS_INTSTA_ENDOFRSM_Msk & ((value) << UDPHS_INTSTA_ENDOFRSM_Pos))
#define UDPHS_INTSTA_UPSTR_RES_Pos            _U_(7)                                               /**< (UDPHS_INTSTA) Upstream Resume Interrupt Position */
#define UDPHS_INTSTA_UPSTR_RES_Msk            (_U_(0x1) << UDPHS_INTSTA_UPSTR_RES_Pos)             /**< (UDPHS_INTSTA) Upstream Resume Interrupt Mask */
#define UDPHS_INTSTA_UPSTR_RES(value)         (UDPHS_INTSTA_UPSTR_RES_Msk & ((value) << UDPHS_INTSTA_UPSTR_RES_Pos))
#define UDPHS_INTSTA_EPT_0_Pos                _U_(8)                                               /**< (UDPHS_INTSTA) Endpoint 0 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_0_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_0_Pos)                 /**< (UDPHS_INTSTA) Endpoint 0 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_0(value)             (UDPHS_INTSTA_EPT_0_Msk & ((value) << UDPHS_INTSTA_EPT_0_Pos))
#define UDPHS_INTSTA_EPT_1_Pos                _U_(9)                                               /**< (UDPHS_INTSTA) Endpoint 1 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_1_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_1_Pos)                 /**< (UDPHS_INTSTA) Endpoint 1 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_1(value)             (UDPHS_INTSTA_EPT_1_Msk & ((value) << UDPHS_INTSTA_EPT_1_Pos))
#define UDPHS_INTSTA_EPT_2_Pos                _U_(10)                                              /**< (UDPHS_INTSTA) Endpoint 2 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_2_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_2_Pos)                 /**< (UDPHS_INTSTA) Endpoint 2 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_2(value)             (UDPHS_INTSTA_EPT_2_Msk & ((value) << UDPHS_INTSTA_EPT_2_Pos))
#define UDPHS_INTSTA_EPT_3_Pos                _U_(11)                                              /**< (UDPHS_INTSTA) Endpoint 3 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_3_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_3_Pos)                 /**< (UDPHS_INTSTA) Endpoint 3 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_3(value)             (UDPHS_INTSTA_EPT_3_Msk & ((value) << UDPHS_INTSTA_EPT_3_Pos))
#define UDPHS_INTSTA_EPT_4_Pos                _U_(12)                                              /**< (UDPHS_INTSTA) Endpoint 4 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_4_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_4_Pos)                 /**< (UDPHS_INTSTA) Endpoint 4 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_4(value)             (UDPHS_INTSTA_EPT_4_Msk & ((value) << UDPHS_INTSTA_EPT_4_Pos))
#define UDPHS_INTSTA_EPT_5_Pos                _U_(13)                                              /**< (UDPHS_INTSTA) Endpoint 5 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_5_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_5_Pos)                 /**< (UDPHS_INTSTA) Endpoint 5 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_5(value)             (UDPHS_INTSTA_EPT_5_Msk & ((value) << UDPHS_INTSTA_EPT_5_Pos))
#define UDPHS_INTSTA_EPT_6_Pos                _U_(14)                                              /**< (UDPHS_INTSTA) Endpoint 6 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_6_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_6_Pos)                 /**< (UDPHS_INTSTA) Endpoint 6 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_6(value)             (UDPHS_INTSTA_EPT_6_Msk & ((value) << UDPHS_INTSTA_EPT_6_Pos))
#define UDPHS_INTSTA_EPT_7_Pos                _U_(15)                                              /**< (UDPHS_INTSTA) Endpoint 7 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_7_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_7_Pos)                 /**< (UDPHS_INTSTA) Endpoint 7 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_7(value)             (UDPHS_INTSTA_EPT_7_Msk & ((value) << UDPHS_INTSTA_EPT_7_Pos))
#define UDPHS_INTSTA_EPT_8_Pos                _U_(16)                                              /**< (UDPHS_INTSTA) Endpoint 8 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_8_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_8_Pos)                 /**< (UDPHS_INTSTA) Endpoint 8 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_8(value)             (UDPHS_INTSTA_EPT_8_Msk & ((value) << UDPHS_INTSTA_EPT_8_Pos))
#define UDPHS_INTSTA_EPT_9_Pos                _U_(17)                                              /**< (UDPHS_INTSTA) Endpoint 9 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_9_Msk                (_U_(0x1) << UDPHS_INTSTA_EPT_9_Pos)                 /**< (UDPHS_INTSTA) Endpoint 9 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_9(value)             (UDPHS_INTSTA_EPT_9_Msk & ((value) << UDPHS_INTSTA_EPT_9_Pos))
#define UDPHS_INTSTA_EPT_10_Pos               _U_(18)                                              /**< (UDPHS_INTSTA) Endpoint 10 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_10_Msk               (_U_(0x1) << UDPHS_INTSTA_EPT_10_Pos)                /**< (UDPHS_INTSTA) Endpoint 10 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_10(value)            (UDPHS_INTSTA_EPT_10_Msk & ((value) << UDPHS_INTSTA_EPT_10_Pos))
#define UDPHS_INTSTA_EPT_11_Pos               _U_(19)                                              /**< (UDPHS_INTSTA) Endpoint 11 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_11_Msk               (_U_(0x1) << UDPHS_INTSTA_EPT_11_Pos)                /**< (UDPHS_INTSTA) Endpoint 11 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_11(value)            (UDPHS_INTSTA_EPT_11_Msk & ((value) << UDPHS_INTSTA_EPT_11_Pos))
#define UDPHS_INTSTA_EPT_12_Pos               _U_(20)                                              /**< (UDPHS_INTSTA) Endpoint 12 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_12_Msk               (_U_(0x1) << UDPHS_INTSTA_EPT_12_Pos)                /**< (UDPHS_INTSTA) Endpoint 12 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_12(value)            (UDPHS_INTSTA_EPT_12_Msk & ((value) << UDPHS_INTSTA_EPT_12_Pos))
#define UDPHS_INTSTA_EPT_13_Pos               _U_(21)                                              /**< (UDPHS_INTSTA) Endpoint 13 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_13_Msk               (_U_(0x1) << UDPHS_INTSTA_EPT_13_Pos)                /**< (UDPHS_INTSTA) Endpoint 13 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_13(value)            (UDPHS_INTSTA_EPT_13_Msk & ((value) << UDPHS_INTSTA_EPT_13_Pos))
#define UDPHS_INTSTA_EPT_14_Pos               _U_(22)                                              /**< (UDPHS_INTSTA) Endpoint 14 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_14_Msk               (_U_(0x1) << UDPHS_INTSTA_EPT_14_Pos)                /**< (UDPHS_INTSTA) Endpoint 14 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_14(value)            (UDPHS_INTSTA_EPT_14_Msk & ((value) << UDPHS_INTSTA_EPT_14_Pos))
#define UDPHS_INTSTA_EPT_15_Pos               _U_(23)                                              /**< (UDPHS_INTSTA) Endpoint 15 Interrupt (cleared upon USB reset) Position */
#define UDPHS_INTSTA_EPT_15_Msk               (_U_(0x1) << UDPHS_INTSTA_EPT_15_Pos)                /**< (UDPHS_INTSTA) Endpoint 15 Interrupt (cleared upon USB reset) Mask */
#define UDPHS_INTSTA_EPT_15(value)            (UDPHS_INTSTA_EPT_15_Msk & ((value) << UDPHS_INTSTA_EPT_15_Pos))
#define UDPHS_INTSTA_DMA_1_Pos                _U_(25)                                              /**< (UDPHS_INTSTA) DMA Channel 1 Interrupt Position */
#define UDPHS_INTSTA_DMA_1_Msk                (_U_(0x1) << UDPHS_INTSTA_DMA_1_Pos)                 /**< (UDPHS_INTSTA) DMA Channel 1 Interrupt Mask */
#define UDPHS_INTSTA_DMA_1(value)             (UDPHS_INTSTA_DMA_1_Msk & ((value) << UDPHS_INTSTA_DMA_1_Pos))
#define UDPHS_INTSTA_DMA_2_Pos                _U_(26)                                              /**< (UDPHS_INTSTA) DMA Channel 2 Interrupt Position */
#define UDPHS_INTSTA_DMA_2_Msk                (_U_(0x1) << UDPHS_INTSTA_DMA_2_Pos)                 /**< (UDPHS_INTSTA) DMA Channel 2 Interrupt Mask */
#define UDPHS_INTSTA_DMA_2(value)             (UDPHS_INTSTA_DMA_2_Msk & ((value) << UDPHS_INTSTA_DMA_2_Pos))
#define UDPHS_INTSTA_DMA_3_Pos                _U_(27)                                              /**< (UDPHS_INTSTA) DMA Channel 3 Interrupt Position */
#define UDPHS_INTSTA_DMA_3_Msk                (_U_(0x1) << UDPHS_INTSTA_DMA_3_Pos)                 /**< (UDPHS_INTSTA) DMA Channel 3 Interrupt Mask */
#define UDPHS_INTSTA_DMA_3(value)             (UDPHS_INTSTA_DMA_3_Msk & ((value) << UDPHS_INTSTA_DMA_3_Pos))
#define UDPHS_INTSTA_DMA_4_Pos                _U_(28)                                              /**< (UDPHS_INTSTA) DMA Channel 4 Interrupt Position */
#define UDPHS_INTSTA_DMA_4_Msk                (_U_(0x1) << UDPHS_INTSTA_DMA_4_Pos)                 /**< (UDPHS_INTSTA) DMA Channel 4 Interrupt Mask */
#define UDPHS_INTSTA_DMA_4(value)             (UDPHS_INTSTA_DMA_4_Msk & ((value) << UDPHS_INTSTA_DMA_4_Pos))
#define UDPHS_INTSTA_DMA_5_Pos                _U_(29)                                              /**< (UDPHS_INTSTA) DMA Channel 5 Interrupt Position */
#define UDPHS_INTSTA_DMA_5_Msk                (_U_(0x1) << UDPHS_INTSTA_DMA_5_Pos)                 /**< (UDPHS_INTSTA) DMA Channel 5 Interrupt Mask */
#define UDPHS_INTSTA_DMA_5(value)             (UDPHS_INTSTA_DMA_5_Msk & ((value) << UDPHS_INTSTA_DMA_5_Pos))
#define UDPHS_INTSTA_DMA_6_Pos                _U_(30)                                              /**< (UDPHS_INTSTA) DMA Channel 6 Interrupt Position */
#define UDPHS_INTSTA_DMA_6_Msk                (_U_(0x1) << UDPHS_INTSTA_DMA_6_Pos)                 /**< (UDPHS_INTSTA) DMA Channel 6 Interrupt Mask */
#define UDPHS_INTSTA_DMA_6(value)             (UDPHS_INTSTA_DMA_6_Msk & ((value) << UDPHS_INTSTA_DMA_6_Pos))
#define UDPHS_INTSTA_DMA_7_Pos                _U_(31)                                              /**< (UDPHS_INTSTA) DMA Channel 7 Interrupt Position */
#define UDPHS_INTSTA_DMA_7_Msk                (_U_(0x1) << UDPHS_INTSTA_DMA_7_Pos)                 /**< (UDPHS_INTSTA) DMA Channel 7 Interrupt Mask */
#define UDPHS_INTSTA_DMA_7(value)             (UDPHS_INTSTA_DMA_7_Msk & ((value) << UDPHS_INTSTA_DMA_7_Pos))
#define UDPHS_INTSTA_Msk                      _U_(0xFEFFFFFF)                                      /**< (UDPHS_INTSTA) Register Mask  */

#define UDPHS_INTSTA_EPT__Pos                 _U_(8)                                               /**< (UDPHS_INTSTA Position) Endpoint x Interrupt (cleared upon USB reset) */
#define UDPHS_INTSTA_EPT__Msk                 (_U_(0xFFFF) << UDPHS_INTSTA_EPT__Pos)               /**< (UDPHS_INTSTA Mask) EPT_ */
#define UDPHS_INTSTA_EPT_(value)              (UDPHS_INTSTA_EPT__Msk & ((value) << UDPHS_INTSTA_EPT__Pos)) 
#define UDPHS_INTSTA_DMA__Pos                 _U_(25)                                              /**< (UDPHS_INTSTA Position) DMA Channel 7 Interrupt */
#define UDPHS_INTSTA_DMA__Msk                 (_U_(0x7F) << UDPHS_INTSTA_DMA__Pos)                 /**< (UDPHS_INTSTA Mask) DMA_ */
#define UDPHS_INTSTA_DMA_(value)              (UDPHS_INTSTA_DMA__Msk & ((value) << UDPHS_INTSTA_DMA__Pos)) 

